'use strict'

module.exports = [
	['POPUP_HEADER_PAYMENT', 'Плащане'],
	['POPUP_HEADER_SUBSEQUENT', 'Регистрирай се'],
	['CARD_NUMBER', 'Номер на картата'],
	['CARD_EXPIRY', 'Валидна до'],
	['CARD_CODE', 'CVC'],
	['PAY', 'Плати'],
	['PAYING', 'Плащане…'],
	['SAVE_CARD', 'Запази карта'],
	['SAVING', 'Запазване…'],
	['POWERED_BY', 'Сигурни разплащания с Paylike'],
	['TDS_FULL_SCREEN_TEXT', 'Проблем с виждането на прозореца?'],
	['TDS_FULL_SCREEN_LINK', 'Отворете в цял екран.'],
	[
		'ERROR_INVALID_CARD_NUMBER',
		'Невалиден номер на картата\nМоля, проверете всички данни за картата. Ако проблемът продължава, обърнете се към Вашата банка.',
	],
	[
		'ERROR_CARD_SECURITY_CODE_INVALID',
		'Невалиден CVC (код за сигурност)\nМоля, проверете CVC (кодът за сигурност), намира се на гърба на Вашата карта. Ако проблемът продължава, обърнете се към Вашата банка.',
	],
	[
		'ERROR_CARD_EXPIRED',
		'Картата е изтекла\nВашата карта е с изтекъл срок. Моля опитайте с друга.',
	],
	[
		'ERROR_CARD_DISABLED',
		'Картата е ограничена\nТази карта е ограничена, обърнете се към Вашата банка за повече информация.',
	],
	[
		'ERROR_CARD_LOST',
		'Картата е изгубена или открадната\nКартата е блокирана и обявена за загубена или открадната, свържете се с Вашата банка за повече информация.',
	],
	[
		'ERROR_AMOUNT_LIMIT',
		'Лимитът за плащане с картата е надминат\nДостигнато е ограничение за сумата на Вашата карта. Обърнете се към Вашата банка, за да занулите или увеличите лимита.',
	],
	[
		'ERROR_INSUFFICIENT_FUNDS',
		'Недостатъчна наличност на средства\nНяма достатъчно средства в картата за покриване на покупката. Опитайте с друга карта или добавите средства към вашата сметка. Ако проблемът продължава, свържете се в Вашата банка.',
	],
	[
		'ERROR_REJECTED_BY_ISSUER',
		'Картата е отхвърлена\nКарта е отхвърлена от Вашата банка. Моля обърнете се към Вашата банка.',
	],
	['ERROR_REJECTED', 'Транзакцията е отхвърлена'],
]
