'use strict'

module.exports = [
	['POPUP_HEADER_PAYMENT', 'Πληρωμή'],
	['POPUP_HEADER_SUBSEQUENT', 'Εγγραφή'],
	['CARD_NUMBER', 'Αριθμός κάρτας'],
	['CARD_EXPIRY', 'Λήξη (ΜΜ/ΕΕ)'],
	['CARD_CODE', 'CVC'],
	['PAY', 'Πληρωμή'],
	['PAYING', 'Πληρωμή σε εξέλιξη...'],
	['SAVE_CARD', 'Αποθήκευση Κάρτας'],
	['SAVING', 'Γίνεται Αποθήκευση...'],
	['POWERED_BY', 'Ασφαλής πληρωμή μέσω Paylike'],
	['TDS_FULL_SCREEN_TEXT', 'Δεν εμφανίζεται το παράθυρο;'],
	['TDS_FULL_SCREEN_LINK', 'Πλήρης οθόνη'],
	[
		'ERROR_INVALID_CARD_NUMBER',
		'Μη έγκυρος αριθμός κάρτας\nΠαρακαλούμε ελέγξτε τον αριθμό της κάρτας. Εάν το πρόβλημα επιμείνει, επικοινωνήστε με την τράπεζά σας.',
	],
	[
		'ERROR_CARD_SCHEME_UNKNOWN',
		'Μη έγκυρος αριθμός κάρτας ή η κάρτα δεν υποστηρίζεται\nΟ αριθμός κάρτας είναι λανθασμένος ή η επωνυμία της κάρτας δεν υποστηρίζεται.',
	],
	[
		'ERROR_CARD_SECURITY_CODE_INVALID',
		'Μη έγκυρος κωδικός ασφαλείας CVC\nΠαρακαλούμε ελέγξτε τον κωδικό ασφαλεία CVC, που βρίσκεται συνήθως στο πίσω μέρος της κάρτας σας. Εάν το πρόβλημα επιμείνει, επικοινωνήστε με την τράπεζά σας.',
	],
	[
		'ERROR_CARD_EXPIRED',
		'Η κάρτα έχει λήξει\nΗ κάρτα σας έχει λήξει. Παρακαλούμε δοκιμάστε μία άλλη.',
	],
	[
		'ERROR_CARD_DISABLED',
		'Η κάρτα είναι περιορισμένη\nΑυτή η κάρτα είναι περιορισμένη, παρακαλούμε επικοινωνήστε με την τράπεζά σας για περισσότερες πληροφορίες.',
	],
	[
		'ERROR_CARD_LOST',
		'Η κάρτα χάθηκε ή εκλάπη\nΗ κάρτα έχει αποκλειστεί και δηλωθεί ως χαμένη ή κλεμμένη, παρακαλούμε επικοινωνήστε με την τράπεζά σας για περισσότερες πληροφορίες.',
	],
	[
		'ERROR_AMOUNT_LIMIT',
		'Υπέρβαση χρηματικού ορίου κάρτας\nΤο χρηματικό όριο στην κάρτα σας έχει παρέλθει. Παρακαλούμε επικοινωνήστε με την τράπεζά σας για επαναφορά ή αύξηση του ορίου.',
	],
	[
		'ERROR_INSUFFICIENT_FUNDS',
		'Δεν υπάρχουν αρκετά χρήματα\nΔεν υπάρχουν αρκετά διαθέσιμα χρήματα για την κάλυψη της αγοράς σας. Παρακαλούμε δοκιμάστε μια άλλη κάρτα ή προσθέστε χρήματα στο λογαριασμό σας. Εάν το πρόβλημα επιμείνει, επικοινωνήστε με την τράπεζά σας.',
	],
	[
		'ERROR_REJECTED_BY_ISSUER',
		'Η κάρτα απορρίφθηκε\nΗ κάρτα απορρίφθηκε από την τράπεζά σας. Παρακαλούμε επικοινωνήστε με την τράπεζά σας.',
	],
]
